package com.playshogi.library.shogi.models.formats.kif;

import com.playshogi.library.shogi.models.formats.sfen.SfenConverter;
import com.playshogi.library.shogi.models.formats.usf.UsfFormat;
import com.playshogi.library.shogi.models.position.ShogiPosition;
import com.playshogi.library.shogi.models.record.GameRecord;
import org.junit.Test;

import static org.junit.Assert.assertEquals;
import static org.junit.Assert.assertNull;

public class KifFormatTest {

    private final String KIF_81 = "#KIF version=2.0 encoding=UTF-8\n" +
            "開始日時：2020/08/10\n" +
            "場所：81Dojo\n" +
            "持ち時間：5分+10秒\n" +
            "手合割：平手\n" +
            "先手：AAA\n" +
            "後手：BBB\n" +
            "手数----指手---------消費時間--\n" +
            "1   ７六歩(77)   (0:4/0:0:4)\n" +
            "2   ３四歩(33)   (0:1/0:0:1)\n" +
            "3   ２六歩(27)   (0:1/0:0:5)\n" +
            "4   ８四歩(83)   (0:2/0:0:3)\n" +
            "5   ２五歩(26)   (0:1/0:0:6)\n" +
            "6   ８五歩(84)   (0:1/0:0:4)\n" +
            "7   ７八金(69)   (0:1/0:0:7)\n" +
            "8   ８八角成(22)   (0:2/0:0:6)\n" +
            "9   同　銀(79)   (0:1/0:0:8)\n" +
            "10   ２二銀(31)   (0:1/0:0:7)\n" +
            "11   ７七銀(88)   (0:1/0:0:9)\n" +
            "12   ３三銀(22)   (0:1/0:0:8)\n" +
            "13   ３八銀(39)   (0:1/0:0:10)\n" +
            "14   ３二金(41)   (0:1/0:0:9)\n" +
            "15   ２七銀(38)   (0:2/0:0:12)\n" +
            "16   ７二銀(71)   (0:14/0:0:23)\n" +
            "17   ２六銀(27)   (0:2/0:0:14)\n" +
            "18   １四歩(13)   (0:2/0:0:25)\n" +
            "19   １六歩(17)   (0:3/0:0:17)\n" +
            "20   ９四歩(93)   (0:19/0:0:44)\n" +
            "21   ６八玉(59)   (0:9/0:0:26)\n" +
            "22   ７四歩(73)   (0:2/0:0:46)\n" +
            "23   １五歩(16)   (0:3/0:0:29)\n" +
            "24   同　歩(14)   (0:1/0:0:47)\n" +
            "25   同　銀(26)   (0:1/0:0:30)\n" +
            "26   同　香(11)   (0:2/0:0:49)\n" +
            "27   同　香(19)   (0:1/0:0:31)\n" +
            "28   １九角打   (0:15/0:1:4)\n" +
            "29   １八飛(28)   (0:12/0:0:43)\n" +
            "30   ２七銀打   (0:2/0:1:6)\n" +
            "31   １九飛(18)   (0:24/0:1:7)\n" +
            "32   １八歩打   (0:2/0:1:8)\n" +
            "33   １二香成(15)   (0:41/0:1:48)\n" +
            "34   １九歩成(18)   (0:1/0:1:9)\n" +
            "35   ２一成香(12)   (0:2/0:1:50)\n" +
            "36   ２九と(19)   (0:4/0:1:13)\n" +
            "37   ５六香打   (0:14/0:2:4)\n" +
            "38   ４四銀(33)   (0:4/0:1:17)\n" +
            "39   ６五桂打   (0:29/0:2:33)\n" +
            "40   ４二金(32)   (0:4/0:1:21)\n" +
            "41   ３一角打   (0:14/0:2:47)\n" +
            "42   ４一桂打   (0:49/0:2:10)\n" +
            "43   ４二角成(31)   (1:28/0:4:15)\n" +
            "44   同　玉(51)   (0:3/0:2:13)\n" +
            "45   ３一角打   (0:2/0:4:17)\n" +
            "46   ５二玉(42)   (0:1/0:2:14)\n" +
            "47   ４二金打   (0:6/0:4:23)\n" +
            "48   ６二玉(52)   (0:1/0:2:15)\n" +
            "49   ４一金(42)   (0:1/0:4:24)\n" +
            "50   ２八飛打   (1:17/0:3:32)\n" +
            "51   ７九玉(68)   (0:8/0:4:32)\n" +
            "52   ７一玉(62)   (0:1/0:3:33)\n" +
            "53   ５三香成(56)   (0:34/0:5:6)\n" +
            "54   ８六歩(85)   (0:1/0:3:34)\n" +
            "55   同　銀(77)   (0:7/0:5:13)\n" +
            "56   同　飛(82)   (0:14/0:3:48)\n" +
            "57   ６二成香(53)   (0:7/0:5:20)\n" +
            "58   同　金(61)   (0:5/0:3:53)\n" +
            "59   ８六角成(31)   (0:2/0:5:22)\n" +
            "60   ８三香打   (0:3/0:3:56)\n" +
            "61   ５一飛打   (0:6/0:5:28)\n" +
            "62   ６一金(62)   (0:26/0:4:22)\n" +
            "63   同　飛成(51)   (0:8/0:5:36)\n" +
            "64   同　玉(71)   (0:11/0:4:33)\n" +
            "65   ５一金(41)   (0:8/0:5:44)\n" +
            "66   ７一玉(61)   (0:10/0:4:43)\n" +
            "67   ５二金(51)   (0:8/0:5:52)\n" +
            "68   ８六香(83)   (0:5/0:4:48)\n" +
            "69   ６二金打   (0:4/0:5:56)\n" +
            "70   ８二玉(71)   (0:3/0:4:51)\n" +
            "71   ７二金(62)   (0:5/0:6:1)\n" +
            "72   同　玉(82)   (0:1/0:4:52)\n" +
            "73   ８六歩(87)   (0:9/0:6:10)\n" +
            "74   ８七角打   (0:14/0:5:6)\n" +
            "75   ５八香打   (0:9/0:6:19)\n" +
            "76   ７六角成(87)   (0:8/0:5:14)\n" +
            "77   ７七桂(89)   (0:8/0:6:27)\n" +
            "78   ８七歩打   (0:3/0:5:17)\n" +
            "79   ８五銀打   (0:8/0:6:35)\n" +
            "80   ８八金打   (0:4/0:5:21)\n" +
            "81   ６九玉(79)   (0:10/0:6:45)\n" +
            "82   ７八金(88)   (0:1/0:5:22)\n" +
            "83   投了   (0:3/0:6:48)";

    private final String KIF_24 = "開始日時：Aug 31, 2020 6:39:53 PM\n" +
            "棋戦：Rating Game Room(short-timelimited)\n" +
            "手合割：平手\n" +
            "先手：AAA(1779)\n" +
            "後手：BBB(1795)\n" +
            "手数----指手---------消費時間--\n" +
            "1 ７六歩(77)   ( 0:02/00:00:02)\n" +
            "2 ３四歩(33)   ( 0:00/00:00:00)\n" +
            "3 ２六歩(27)   ( 0:02/00:00:04)\n" +
            "4 ５四歩(53)   ( 0:02/00:00:02)\n" +
            "5 ２五歩(26)   ( 0:03/00:00:07)\n" +
            "6 ５二飛(82)   ( 0:01/00:00:03)\n" +
            "7 ４八銀(39)   ( 0:01/00:00:08)\n" +
            "8 ６二玉(51)   ( 0:01/00:00:04)\n" +
            "9 ２二角成(88)   ( 0:07/00:00:15)\n" +
            "10 ２二銀(31)   ( 0:02/00:00:06)\n" +
            "11 ９六歩(97)   ( 0:01/00:00:16)\n" +
            "12 ９四歩(93)   ( 0:01/00:00:07)\n" +
            "13 ７八銀(79)   ( 0:01/00:00:17)\n" +
            "14 ７二玉(62)   ( 0:01/00:00:08)\n" +
            "15 ６八玉(59)   ( 0:02/00:00:19)\n" +
            "16 ８二玉(72)   ( 0:01/00:00:09)\n" +
            "17 ４六歩(47)   ( 0:01/00:00:20)\n" +
            "18 ７二銀(71)   ( 0:01/00:00:10)\n" +
            "19 ６六歩(67)   ( 0:15/00:00:35)\n" +
            "20 ６四歩(63)   ( 0:01/00:00:11)\n" +
            "21 ２四歩(25)   ( 0:06/00:00:41)\n" +
            "22 ２四歩(23)   ( 0:01/00:00:12)\n" +
            "23 ２四飛(28)   ( 0:01/00:00:42)\n" +
            "24 ２三歩打     ( 0:01/00:00:13)\n" +
            "25 ２八飛(24)   ( 0:07/00:00:49)\n" +
            "26 ５五歩(54)   ( 0:01/00:00:14)\n" +
            "27 ４七銀(48)   ( 0:02/00:00:51)\n" +
            "28 ５一飛(52)   ( 0:02/00:00:16)\n" +
            "29 １六角打     ( 0:15/00:01:06)\n" +
            "30 ３二金(41)   ( 0:06/00:00:22)\n" +
            "31 ３四角(16)   ( 0:02/00:01:08)\n" +
            "32 ５四飛(51)   ( 0:16/00:00:38)\n" +
            "33 ４五角(34)   ( 0:02/00:01:10)\n" +
            "34 ２四飛(54)   ( 0:16/00:00:54)\n" +
            "35 ２五歩打     ( 0:18/00:01:28)\n" +
            "36 ４四飛(24)   ( 0:03/00:00:57)\n" +
            "37 ７九玉(68)   ( 0:05/00:01:33)\n" +
            "38 ３三銀(22)   ( 0:04/00:01:01)\n" +
            "39 ８八玉(79)   ( 0:06/00:01:39)\n" +
            "40 ３四銀(33)   ( 0:02/00:01:03)\n" +
            "41 ６七角(45)   ( 0:10/00:01:49)\n" +
            "42 ６五歩(64)   ( 0:01/00:01:04)\n" +
            "43 ７七銀(78)   ( 0:25/00:02:14)\n" +
            "44 ３三桂(21)   ( 0:09/00:01:13)\n" +
            "45 ２四歩(25)   ( 0:05/00:02:19)\n" +
            "46 ２四歩(23)   ( 0:02/00:01:15)\n" +
            "47 ２四飛(28)   ( 0:02/00:02:21)\n" +
            "48 ２三金(32)   ( 0:01/00:01:16)\n" +
            "49 ２八飛(24)   ( 0:10/00:02:31)\n" +
            "50 ２四歩打     ( 0:22/00:01:38)\n" +
            "51 ６五歩(66)   ( 0:09/00:02:40)\n" +
            "52 ２二金(23)   ( 0:15/00:01:53)\n" +
            "53 反則勝ち";

    private final String KIF_PYO = "# ---- ぴよ将棋w 棋譜ファイル ----\n" +
            "棋戦：ぴよ将棋w ハ枚落ち（トンボ）\n" +
            "開始日時：2020/09/27 18:07:32\n" +
            "終了日時：2020/09/27 18:09:25\n" +
            "下手：プレイヤー\n" +
            "上手：Lv16 ピヨ郎(R810)\n" +
            "手合割：その他\n" +
            "上手の持駒：\n" +
            "  ９ ８ ７ ６ ５ ４ ３ ２ １\n" +
            "+---------------------------+\n" +
            "| ・ ・ ・ ・v玉 ・ ・ ・ ・|一\n" +
            "| ・v飛 ・ ・ ・ ・ ・v角 ・|二\n" +
            "|v歩v歩v歩v歩v歩v歩v歩v歩v歩|三\n" +
            "| ・ ・ ・ ・ ・ ・ ・ ・ ・|四\n" +
            "| ・ ・ ・ ・ ・ ・ ・ ・ ・|五\n" +
            "| ・ ・ ・ ・ ・ ・ ・ ・ ・|六\n" +
            "| 歩 歩 歩 歩 歩 歩 歩 歩 歩|七\n" +
            "| ・ 角 ・ ・ ・ ・ ・ 飛 ・|八\n" +
            "| 香 桂 銀 金 玉 金 銀 桂 香|九\n" +
            "+---------------------------+\n" +
            "下手の持駒：\n" +
            "上手番\n" +
            "手数----指手---------消費時間--\n" +
            "   1 ８四歩(83)   ( 0:01/00:00:01)\n" +
            "   2 ２六歩(27)   ( 0:01/00:00:01)\n" +
            "   3 ８五歩(84)   ( 0:01/00:00:02)\n" +
            "   4 ２五歩(26)   ( 0:01/00:00:02)\n" +
            "   5 ８六歩(85)   ( 0:01/00:00:03)\n" +
            "   6 ８六歩(87)   ( 0:01/00:00:03)\n" +
            "   7 ８六飛(82)   ( 0:01/00:00:04)\n" +
            "   8 ７六歩(77)   ( 0:01/00:00:04)\n" +
            "   9 ８四飛(86)   ( 0:01/00:00:05)\n" +
            "  10 ７八金(69)   ( 0:02/00:00:06)\n" +
            "  11 ６一玉(51)   ( 0:01/00:00:06)\n" +
            "  12 ８七歩打     ( 0:04/00:00:10)\n" +
            "  13 ５二玉(61)   ( 0:01/00:00:07)\n" +
            "  14 ３八銀(39)   ( 0:01/00:00:11)\n" +
            "  15 ８一飛(84)   ( 0:01/00:00:08)\n" +
            "  16 ２七銀(38)   ( 0:01/00:00:12)\n" +
            "  17 ８五歩打     ( 0:01/00:00:09)\n" +
            "  18 ３六銀(27)   ( 0:02/00:00:14)\n" +
            "  19 ８四飛(81)   ( 0:01/00:00:10)\n" +
            "  20 ３五銀(36)   ( 0:01/00:00:15)\n" +
            "  21 ６四飛(84)   ( 0:01/00:00:11)\n" +
            "  22 ２四歩(25)   ( 0:01/00:00:16)\n" +
            "  23 ２四歩(23)   ( 0:01/00:00:12)\n" +
            "  24 ２四銀(35)   ( 0:01/00:00:17)\n" +
            "  25 ２六歩打     ( 0:01/00:00:13)\n" +
            "  26 ２六飛(28)   ( 0:01/00:00:18)\n" +
            "  27 ３一角(22)   ( 0:01/00:00:14)\n" +
            "  28 ３三銀成(24) ( 0:02/00:00:20)\n" +
            "  29 ８六歩(85)   ( 0:01/00:00:15)\n" +
            "  30 ２一飛成(26) ( 0:01/00:00:21)\n" +
            "  31 ８七歩成(86) ( 0:01/00:00:16)\n" +
            "  32 ８七金(78)   ( 0:01/00:00:22)\n" +
            "  33 ６七飛成(64) ( 0:01/00:00:17)\n" +
            "  34 ３一龍(21)   ( 0:05/00:00:27)\n" +
            "  35 ８七龍(67)   ( 0:01/00:00:18)\n" +
            "  36 ４二龍(31)   ( 0:01/00:00:28)\n" +
            "  37 ６一玉(52)   ( 0:01/00:00:19)\n" +
            "  38 ５八金(49)   ( 0:06/00:00:34)\n" +
            "  39 ２八歩打     ( 0:01/00:00:20)\n" +
            "  40 ８二歩打     ( 0:05/00:00:39)\n" +
            "  41 ５二金打     ( 0:01/00:00:21)\n" +
            "  42 ４一龍(42)   ( 0:03/00:00:42)\n" +
            "  43 ５一金(52)   ( 0:01/00:00:22)\n" +
            "  44 ３二龍(41)   ( 0:04/00:00:46)\n" +
            "  45 ７一玉(61)   ( 0:01/00:00:23)\n" +
            "  46 ４三成銀(33) ( 0:06/00:00:52)\n" +
            "  47 ２九歩成(28) ( 0:01/00:00:24)\n" +
            "  48 ３三角成(88) ( 0:02/00:00:54)\n" +
            "  49 ４二金(51)   ( 0:01/00:00:25)\n" +
            "  50 ４二龍(32)   ( 0:01/00:00:55)\n" +
            "  51 ２八と(29)   ( 0:01/00:00:26)\n" +
            "  52 ７二金打     ( 0:01/00:00:56)\n" +
            "  53 投了         ( 0:00/00:00:26)\n" +
            "まで52手で下手の勝ち";

    private final String KIF_GOTE_POSITION = "#KIF version=2.0 encoding=UTF-8\n" +
            "後手の持駒：角　歩\n" +
            "  ９ ８ ７ ６ ５ ４ ３ ２ １\n" +
            "+---------------------------+\n" +
            "|v香v桂 ・v金 ・ ・ ・v桂v香|一\n" +
            "| ・v玉v銀 ・v金 ・ ・v飛 ・|二\n" +
            "| ・v歩v歩v歩v歩 ・ ・v歩v歩|三\n" +
            "|v歩 ・ ・ ・ ・v銀v歩 ・ ・|四\n" +
            "| ・ ・ ・ ・ ・ ・ ・ 歩 ・|五\n" +
            "| 歩 ・ 歩 歩 ・ 銀 歩 ・ 歩|六\n" +
            "| ・ 歩 銀 ・ 歩 ・ ・ ・ ・|七\n" +
            "| ・ 玉 金 ・ ・ ・ ・ 飛 ・|八\n" +
            "| 香 桂 ・ ・ ・ 金 ・ 桂 香|九\n" +
            "+---------------------------+\n" +
            "先手の持駒：角　歩\n" +
            "後手番\n" +
            "先手：AAA\n" +
            "後手：BBB\n" +
            "手数＝33  ▲４六同銀  まで";

    private final String KIF_ONLY_POSITION = "後手の持駒：角　歩\n" +
            "  ９ ８ ７ ６ ５ ４ ３ ２ １\n" +
            "+---------------------------+\n" +
            "|v香v桂 ・v金 ・ ・ ・v桂v香|一\n" +
            "| ・v玉v銀 ・v金 ・ ・v飛 ・|二\n" +
            "| ・v歩v歩v歩v歩 ・ ・v歩v歩|三\n" +
            "|v歩 ・ ・ ・ ・v銀v歩 ・ ・|四\n" +
            "| ・ ・ ・ ・ ・ ・ ・ 歩 ・|五\n" +
            "| 歩 ・ 歩 歩 ・ 銀 歩 ・ 歩|六\n" +
            "| ・ 歩 銀 ・ 歩 ・ ・ ・ ・|七\n" +
            "| ・ 玉 金 ・ ・ ・ ・ 飛 ・|八\n" +
            "| 香 桂 ・ ・ ・ 金 ・ 桂 香|九\n" +
            "+---------------------------+\n" +
            "先手の持駒：角　歩\n" +
            "後手番\n";

    private final String KIF_ONLY_POSITION_DOKORO = "#KIF version=2.0 encoding=UTF-8\n" +
            "後手の持駒：なし\n" +
            "  ９ ８ ７ ６ ５ ４ ３ ２ １\n" +
            "+---------------------------+\n" +
            "|v香v桂v銀v金v玉v金v銀v桂v香|一\n" +
            "| ・v飛 ・ ・ ・ ・ ・ 馬 ・|二\n" +
            "|v歩v歩v歩v歩v歩v歩 ・v歩v歩|三\n" +
            "| ・ ・ ・ ・ ・ ・v歩 ・ ・|四\n" +
            "| ・ ・ ・ ・ ・ ・ ・ ・ ・|五\n" +
            "| ・ ・ 歩 ・ ・ ・ ・ ・ ・|六\n" +
            "| 歩 歩 ・ 歩 歩 歩 歩 歩 歩|七\n" +
            "| ・ ・ ・ ・ ・ ・ ・ 飛 ・|八\n" +
            "| 香 桂 銀 金 玉 金 銀 桂 香|九\n" +
            "+---------------------------+\n" +
            "先手の持駒：角\n" +
            "後手番\n" +
            "先手：\n" +
            "後手：\n";

    private final String ANOTHER_KIF = "先手：AAA 初段\n" +
            "後手：BBB 初段\n" +
            "開始日時：2020/09/28 22:00:12\n" +
            "棋戦：将棋ウォーズ(10分切れ負け)\n" +
            "持ち時間：10分\n" +
            "先手の囲い：elmo囲い, 左山囲い\n" +
            "後手の囲い：美濃囲い\n" +
            "先手の備考：居飛車, 対振り, 対抗型\n" +
            "後手の備考：振り飛車, 対抗型\n" +
            "手合割：平手\n" +
            "手数----指手---------消費時間--\n" +
            "   1 ２六歩(27)   (00:01/00:00:01)\n" +
            "*▲備考：居飛車\n" +
            "   2 ３四歩(33)   (00:00/00:00:00)\n" +
            "   3 ２五歩(26)   (00:00/00:00:01)\n" +
            "   4 ３三角(22)   (00:01/00:00:01)\n" +
            "   5 ４八銀(39)   (00:01/00:00:02)\n" +
            "   6 ３二銀(31)   (00:01/00:00:02)\n" +
            "   7 １六歩(17)   (00:00/00:00:02)\n" +
            "   8 ４四歩(43)   (00:02/00:00:04)\n" +
            "   9 ３六歩(37)   (00:01/00:00:03)\n" +
            "  10 ４三銀(32)   (00:01/00:00:05)\n" +
            "  11 ３七銀(48)   (00:00/00:00:03)\n" +
            "  12 ３二飛(82)   (00:01/00:00:06)\n" +
            "*△備考：振り飛車\n" +
            "  13 ６八玉(59)   (00:01/00:00:04)\n" +
            "  14 ６二玉(51)   (00:01/00:00:07)\n" +
            "  15 ７八玉(68)   (00:01/00:00:05)\n" +
            "  16 ７二玉(62)   (00:01/00:00:08)\n" +
            "  17 ６八銀(79)   (00:01/00:00:06)\n" +
            "  18 ８二玉(72)   (00:01/00:00:09)\n" +
            "  19 ７九金(69)   (00:00/00:00:06)\n" +
            "*▲囲い：elmo囲い\n" +
            "  20 ７二銀(71)   (00:01/00:00:10)\n" +
            "*△囲い：片美濃囲い\n" +
            "  21 ９六歩(97)   (00:01/00:00:07)\n" +
            "  22 ９四歩(93)   (00:01/00:00:11)\n" +
            "  23 ４六銀(37)   (00:00/00:00:07)\n" +
            "  24 ５四歩(53)   (00:15/00:00:26)\n" +
            "  25 ５六歩(57)   (00:02/00:00:09)\n" +
            "  26 ５二金(41)   (00:03/00:00:29)\n" +
            "*△囲い：美濃囲い\n" +
            "  27 ５九金(49)   (00:01/00:00:10)\n" +
            "*▲囲い：左山囲い\n" +
            "  28 ４二角(33)   (00:05/00:00:34)\n" +
            "  29 ７六歩(77)   (00:06/00:00:16)\n" +
            "  30 １二香(11)   (00:15/00:00:49)\n" +
            "  31 １五歩(16)   (00:03/00:00:19)\n" +
            "  32 ６四角(42)   (00:12/00:01:01)\n" +
            "  33 ５五歩(56)   (00:03/00:00:22)\n" +
            "  34 ４五歩(44)   (00:29/00:01:30)\n" +
            "  35 ４五銀(46)   (00:03/00:00:25)\n" +
            "  36 ５五角(64)   (00:02/00:01:32)\n" +
            "  37 ５五角(88)   (00:10/00:00:35)\n" +
            "  38 ５五歩(54)   (00:01/00:01:33)\n" +
            "  39 ２四歩(25)   (00:08/00:00:43)\n" +
            "  40 ２四歩(23)   (00:02/00:01:35)\n" +
            "  41 ２三角打     (00:29/00:01:12)\n" +
            "  42 ２二飛(32)   (00:02/00:01:37)\n" +
            "  43 ３四銀(45)   (00:02/00:01:14)\n" +
            "  44 ３二銀(43)   (01:39/00:03:16)\n" +
            "  45 ３二角成(23) (00:09/00:01:23)\n" +
            "  46 ３二飛(22)   (00:01/00:03:17)\n" +
            "  47 ４三銀打     (00:02/00:01:25)\n" +
            "  48 ３一飛(32)   (00:18/00:03:35)\n" +
            "  49 ２四飛(28)   (00:16/00:01:41)\n" +
            "  50 ５六歩(55)   (00:12/00:03:47)\n" +
            "  51 ７七桂(89)   (00:34/00:02:15)\n" +
            "  52 ４三金(52)   (00:35/00:04:22)\n" +
            "  53 ４三銀成(34) (00:03/00:02:18)\n" +
            "  54 ３六飛(31)   (00:02/00:04:24)\n" +
            "  55 ２一飛成(24) (00:09/00:02:27)\n" +
            "  56 ３九飛成(36) (00:25/00:04:49)\n" +
            "  57 ５八歩打     (00:05/00:02:32)\n" +
            "  58 ５七歩成(56) (00:04/00:04:53)\n" +
            "  59 ５七銀(68)   (00:07/00:02:39)\n" +
            "  60 ５九龍(39)   (00:10/00:05:03)\n" +
            "  61 ５三桂打     (00:21/00:03:00)\n" +
            "  62 ７一金(61)   (00:33/00:05:36)\n" +
            "  63 ５二成銀(43) (00:03/00:03:03)\n" +
            "  64 ３五角打     (00:10/00:05:46)\n" +
            "  65 １二龍(21)   (00:25/00:03:28)\n" +
            "  66 ３四角打     (00:36/00:06:22)\n" +
            "  67 ３二龍(12)   (00:07/00:03:35)\n" +
            "  68 ７九龍(59)   (00:27/00:06:49)\n" +
            "  69 ７九玉(78)   (00:02/00:03:37)\n" +
            "  70 ６七角成(34) (00:01/00:06:50)\n" +
            "  71 ６八金打     (00:09/00:03:46)\n" +
            "  72 ８九金打     (00:11/00:07:01)\n" +
            "  73 ６九玉(79)   (00:01/00:03:47)\n" +
            "  74 ５七角成(35) (00:02/00:07:03)\n" +
            "  75 ５七歩(58)   (00:02/00:03:49)\n" +
            "  76 ７八銀打     (00:07/00:07:10)\n" +
            "  77 ５九玉(69)   (00:02/00:03:51)\n" +
            "  78 ４九金打     (00:02/00:07:12)\n" +
            "  79 詰み\n" +
            "まで78手で後手の勝ち";

    @Test
    public void readFromShogiClub24Kifu() {
        GameRecord kif24 = KifFormat.INSTANCE.read(KIF_24).get(0);
        assertEquals("USF:1.0\n" +
                "^w:7g7f3c3d2g2f5c5d2f2e8b5b3i4h5a6b8h2B3a2b9g9f9c9d7i7h6b7b5i6h7b8b4g4f7a7b6g6f6c6d2e2d2c2d2h2dp" +
                "*2c2d2h5d5e4h4g5b5aB*1f4a3b1f3d5a5d3d4e5d2dP" +
                "*2e2d4d6h7i2b3c7i8h3c3d4e6g6d6e7h7g2a3c2e2d2c2d2h2d3b2c2d2hp*2d6f6e2c2bFOUL\n" +
                "BN:AAA(1779)\n" +
                "WN:BBB(1795)\n" +
                "GD:Aug 31, 2020 6:39:53 PM\n" +
                "GN:Rating Game Room(short-timelimited)\n", UsfFormat.INSTANCE.write(kif24));
    }

    @Test
    public void readFrom81DojoKifu() {
        GameRecord kif81 = KifFormat.INSTANCE.read(KIF_81).get(0);
        assertEquals("USF:1.0\n" +
                "^w:7g7f3c3d2g2f8c8d2f2e8d8e6i7h2b8H7i8h3a2b8h7g2b3c3i3h4a3b3h2g7a7b2g2f1c1d1g1f9c9d5i6h7c7d1f1e1d1e" +
                "2f1e1a1e1i1eb*1i2h1hs*2g1h1ip*1h1e1B1h1I1b2a1i2iL*5f3c4dN*6e3b4bB*3an*4a3a4B5a4bB*3a4b5bG*4b5b6b4b4a" +
                "r*2h6h7i6b7a5f5C8e8f7g8f8b8f5c6b6a6b3a8Fl*8cR*5a6b6a5a6A7a6a4a5a6a7a5a5b8c8fG*6b7a8b6b7b8b7b8g8fb*8g" +
                "L*5h8g7F8i7gp*8gS*8eg*8h7i6i8h7hRSGN\n" +
                "BN:AAA\n" +
                "WN:BBB\n" +
                "GD:2020/08/10\n" +
                "GQ:81Dojo\n", UsfFormat.INSTANCE.write(kif81));
    }

    @Test
    public void readFromPyo() {
        assertNull(KifFormat.INSTANCE.read(KIF_PYO));
        // Right now handicap games are not read correctly
    }

    @Test
    public void readFromGotePosition() {
        GameRecord kif = KifFormat.INSTANCE.read(KIF_GOTE_POSITION).get(0);
        assertEquals("USF:1.0\n" +
                "^*ln1g3nl/1ks1g2r1/1pppp2pp/p4sp2/7P1/P1PP1SP1P/1PS1P4/1KG4R1/LN3G1NL w BPbp:\n" +
                "BN:AAA\n" +
                "WN:BBB\n" +
                "GD:1000-1-1\n", UsfFormat.INSTANCE.write(kif));
    }

    @Test
    public void readFromShogiExtend() {
        GameRecord kif = KifFormat.INSTANCE.read(ANOTHER_KIF).get(0);
        assertEquals("USF:1.0\n" +
                "^w:2g2f3c3d2f2e2b3c3i4h3a3b1g1f4c4d3g3f3b4c4h3g8b3b5i6h5a6b6h7h6b7b7i6h7b8b6i7i7a7b9g9f9c9d3g4f5c5d" +
                "5g5f4a5b4i5i3c4b7g7f1a1b1f1e4b6d5f5e4d4e4f4e6d5e8h5e5d5e2e2d2c2dB*2c3b2b4e3d4c3b2c3B2b3bS" +
                "*4c3b3a2h2d5e5f8i7g5b4c3d4C3a3f2d2A3f3IP*5h5f5G6h5g3i5iN*5c6a7a4c5bb*3e2a1bb*3d1b3b5i7i7h7i3d" +
                "6GG*6hg*8i7i6i3e5G5h5gs*7h6i5ig*4iMATE\n" +
                "BN:AAA 初段\n" +
                "WN:BBB 初段\n" +
                "GD:2020/09/28 22:00:12\n" +
                "GN:将棋ウォーズ(10分切れ負け)\n", UsfFormat.INSTANCE.write(kif));
    }

    @Test
    public void readPosition() {
        ShogiPosition pos = KifFormat.INSTANCE.readPosition(KIF_GOTE_POSITION);
        assertEquals("ln1g3nl/1ks1g2r1/1pppp2pp/p4sp2/7P1/P1PP1SP1P/1PS1P4/1KG4R1/LN3G1NL w BPbp",
                SfenConverter.toSFEN(pos));
    }

    @Test
    public void readOnlyPosition() {
        ShogiPosition pos = KifFormat.INSTANCE.readPosition(KIF_ONLY_POSITION);
        assertEquals("ln1g3nl/1ks1g2r1/1pppp2pp/p4sp2/7P1/P1PP1SP1P/1PS1P4/1KG4R1/LN3G1NL w BPbp",
                SfenConverter.toSFEN(pos));
    }

    @Test
    public void readOnlyPositionDokoro() {
        ShogiPosition pos = KifFormat.INSTANCE.readPosition(KIF_ONLY_POSITION_DOKORO);
        assertEquals("lnsgkgsnl/1r5+B1/pppppp1pp/6p2/9/2P6/PP1PPPPPP/7R1/LNSGKGSNL w B", SfenConverter.toSFEN(pos));
    }

}